import library

In [18]:
import pandas as pd
import numpy as np

In [19]:
price_df=pd.read_csv("./Dataset/carvana.csv")

In [20]:
price_df.head()

              Name   Year  Miles  Price
0   Chevrolet Trax   2018  41946  16990
1      GMC Terrain   2020  45328  23990
2    Jeep Wrangler   2012  81068  21590
3    Jeep Renegade   2019  35372  21590
4            BMW X  20173  68992  22990

In [21]:
price_df.describe()

               Year          Miles          Price
count  2.200000e+04   22000.000000   22000.000000
mean   1.946648e+05   54445.697318   20707.285136
std    1.630370e+06   25685.933926    6535.580304
min    2.009000e+03      53.000000   10990.000000
25%    2.014000e+03   35512.000000   16590.000000
50%    2.017000e+03   51890.000000   19590.000000
75%    2.020000e+03   73191.000000   22990.000000
max    2.022350e+07  120167.000000  102990.000000

In [22]:
price_df.isnull().sum()

Name     0
Year     0
Miles    0
Price    0
dtype: int64

In [23]:
price_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22000 entries, 0 to 21999
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    22000 non-null  object
 1   Year    22000 non-null  int64
 2   Miles   22000 non-null  int64
 3   Price   22000 non-null  int64
dtypes: int64(3), object(1)
memory usage: 687.6+ KB

In [24]:
price_df.iloc[2]

Name      Jeep Wrangler
Year               2012
Miles             81068
Price             21590
Name: 2, dtype: object

In [25]:
price_df.iloc[2:4]

             Name  Year  Miles  Price
2   Jeep Wrangler  2012  81068  21590
3   Jeep Renegade  2019  35372  21590

In [26]:
price_df.isnull().head()

    Name   Year  Miles  Price
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False

In [27]:
def check_category(df):
    return pd.Series({c: df.select_dtypes("object")[c].unique() for c in df.select_dtypes("object")})

In [28]:
check_category(price_df)

Name    [ Chevrolet Trax,  GMC Terrain,  Jeep Wrangler...
dtype: object